avrxml/AS6-Devices-XML/ATSAM3N4B.xml
          </instance>
        </module>
        <module name="TC" id="TC" version="6082O">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" id="TWI" version="6212L">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="UART" version="6418E">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PB2" function="A" group="URXD" index="1"/>
              <signal pad="PB3" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="USART" id="USART" version="6089W">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PA8" function="A" group="CTS" index="0"/>
              <signal pad="PA7" function="A" group="RTS" index="0"/>
              <signal pad="PA5" function="A" group="RXD" index="0"/>
              <signal pad="PA2" function="B" group="SCK" index="0"/>
              <signal pad="PA6" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40028000"/>
            <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PA22" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="WDT" version="6080B">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
          </instance>
        </module>
        <module name="FUSES" id="FUSES" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
      </peripherals>
      
      
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
      <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2E03F"/>
          <property name="CHIPID_CIDR" value="0x29440960"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-digital Converter" name="ADC" version="6489I">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
