avrxml/AS6-Devices-XML/ATSAM3N4B.xml
      <value-group name="ENDIANNESS">
        <value value="0" name="VALUE_0" caption="Little-endian"/>
        <value value="1" name="VALUE_1" caption="Big-endian"/>
      </value-group>
      <value-group name="SLEEPONEXIT">
        <value value="0" name="VALUE_0" caption="o not sleep when returning to Thread mode"/>
        <value value="1" name="VALUE_1" caption="enter sleep, or deep sleep, on return from an ISR"/>
      </value-group>
      <value-group name="SLEEPDEEP">
        <value value="0" name="VALUE_0" caption="sleep"/>
        <value value="1" name="VALUE_1" caption="deep sleep"/>
      </value-group>
      <value-group name="SEVONPEND">
        <value value="0" name="VALUE_0" caption="only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded"/>
        <value value="1" name="VALUE_1" caption="enabled events and all interrupts, including disabled interrupts, can wakeup the processor"/>
      </value-group>
      <value-group name="NONBASETHRDENA">
        <value value="0" name="VALUE_0" caption="processor can enter Thread mode only when no exception is active"/>
        <value value="1" name="VALUE_1" caption="processor can enter Thread mode from any level under the control of an EXC_RETURN value"/>
      </value-group>
      <value-group name="USERSETMPEND">
        <value value="0" name="VALUE_0" caption="disable"/>
        <value value="1" name="VALUE_1" caption="enable"/>
      </value-group>
      <value-group name="UNALIGN_TRP">
        <value value="0" name="VALUE_0" caption="do not trap unaligned halfword and word accesses"/>
        <value value="1" name="VALUE_1" caption="trap unaligned halfword and word accesses"/>
      </value-group>
      <value-group name="DIV_0_TRP">
        <value value="0" name="VALUE_0" caption="do not trap divide by 0"/>
        <value value="1" name="VALUE_1" caption="trap divide by 0"/>
      </value-group>
      <value-group name="BFHFNMIGN">
        <value value="0" name="VALUE_0" caption="data bus faults caused by load and store instructions cause a lock-up"/>
        <value value="1" name="VALUE_1" caption="handlers running at priority -1 and -2 ignore data bus faults caused by load and store instructions"/>
      </value-group>
      <value-group name="STKALIGN">
        <value value="0" name="VALUE_0" caption="4-byte aligned"/>
        <value value="1" name="VALUE_1" caption="8-byte aligned"/>
      </value-group>
      <value-group name="MEMFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="BUSFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="USGFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="SVCALLACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="MONITORACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="PENDSVACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="SYSTICKACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="USGFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="MEMFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="BUSFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="SVCALLPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="MEMFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="BUSFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="USGFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="IACCVIOL">
        <value value="0" name="VALUE_0" caption="no instruction access violation fault"/>
        <value value="1" name="VALUE_1" caption="the processor attempted an instruction fetch from a location that does not permit execution"/>
      </value-group>
      <value-group name="DACCVIOL">
        <value value="0" name="VALUE_0" caption="no data access violation fault"/>
        <value value="1" name="VALUE_1" caption="the processor attempted a load or store at a location that does not permit the operation"/>
      </value-group>
      <value-group name="MUNSTKERR">
        <value value="0" name="VALUE_0" caption="no unstacking fault"/>
        <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more access violations"/>
      </value-group>
